const regs = {
  onlyNumber: /^\d+$/, // 仅数字
  positiveInteger: /^[1-9]\d*$/, // 正整数
  notNegativeInterger: /^[0-9]+?$/, //非负整数
  onlyChinese: /[\u4e00-\u9fa5]/gm, // 仅汉字
  onlyEnglish: /^[a-z]+$/i, // 仅英文字母
  onlyLowerCase: /^[a-z]+$/, // 仅小写英文字母
  onlyUpperCase: /^[A-Z]+$/, // 仅大写英文字母
  onlyEnglishAndNumber: /^[a-z0-9]+$/i, // 仅英文字母和数字
  onlyEnglishAndUnderline: /^[a-z_]+$/i, // 仅英文字母和下划线
  noSpace: /^[^\s]*$/, //不能有空格
  email: /\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/, // 邮箱地址
  url: /^https?:\/\/(([a-zA-Z0-9_-])+(\.)?)*(:\d+)?(\/((\.)?(\?)?=?&?[a-zA-Z0-9_-](\?)?)*)*$/i, // url地址
  phoneStrict: /^(0|86|17951)?(13[0-9]|15[012356789]|166|17[3678]|18[0-9]|14[5789]|19[0-9])[0-9]{8}$/,
  phone: /^1[0-9]{10}/,
  idNumber: /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/, // 身份证号
  date: /^[1-2][0-9][0-9][0-9]-[0-1]{0,1}[0-9]-[0-3]{0,1}[0-9]$/, // 日期 yyyy-MM-DD
  concurrencyReg: /^[1-9]\d*$|^([1-9]\d*)([+])([1-9]\d*)$/, // 并发数: x+x
  ip: /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])(\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])|\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\/([1-9]|[1-2]\d|3[0-1]))$/, // ip地址
  mac: /^([0-9a-fA-F]{2})(([/\s:-][0-9a-fA-F]{2}){5})$/, // mac地址
  port: /^([0-9]|[1-9]\d|[1-9]\d{2}|[1-9]\d{3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/, // 端口正则
  passowrd: /^(((?=.*[a-zA-Z])(?=.*\d)[a-zA-Z\d])|([\d])|([a-zA-Z])){6,16}$/,
  mettingName: /^\S.{0,30}\S$|^\S{1,32}$/,
};

export default regs;
